W6/W6D3/FirstRoutes/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2], ["created_at", "2021-08-12 17:49:15.220906"], ["updated_at", "2021-08-12 17:49:15.220906"]]
---
    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 4]]
---
    def destroy
      @artwork_share = ArtworkShare.find_by(id: params[:id])
      if @artwork_share
        @artwork_share.destroy