W6/W6D3/FirstRoutes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE (artworks.artist_id = '1' OR artwork_shares.viewer_id = '1')
---
  def index
    user_id = params[:user_id]
    @artworks = Artwork.joins(:shared_viewers).where('artworks.artist_id = ? OR artwork_shares.viewer_id = ?', user_id, user_id)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "yell"], ["updated_at", "2021-08-12 17:38:43.714907"], ["id", 4]]
---
  def update
    @artwork = Artwork.find_by(id: params[:id])
    if @artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]
---
  def destroy
    @artwork = Artwork.find_by(id: params[:id])
    if @artwork
      @artwork.destroy