W6/W6D3/FirstRoutes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "josh"]]
---
    def index
    debugger
      if params[:username].blank?
        @users = User.all
      elsif params[:query]
        @users = User.where(username: params[:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def update
      @user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
      @user = User.find_by(id: params[:id])
      if @user
        @user.destroy