W6/W6D5/cats_99/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "whitey"], ["sex", "F"], ["description", "hello"], ["updated_at", "2021-08-13 22:35:04.081202"], ["id", 4]]