W7/W7D1/joshua_zhao/build_rails_project/BlogApp/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "saddassad"], ["author_id", 1], ["body", "sdaadsdsasda"], ["created_at", "2019-09-20 23:06:21.734593"], ["updated_at", "2019-09-20 23:06:21.734593"]]
---
  def create
    @blog = Blog.new(blog_params)
    if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 72]]
---
  def destroy
    @blog = Blog.find_by(id: params[:id])
    @blog.destroy